Repository: fraca7/dsremap
Catalog: i18n/*.po
Languages: fr_fr

source: left pad
fr_fr: pad gauche

source: right pad
fr_fr: pad droit

source: X axis
fr_fr: axe X

source: Y axis
fr_fr: axe Y

source: Invert {pad} {axis}
fr_fr: Inverser l’{axis} du {pad}

source: left pad X
fr_fr: pad gauche X

source: left pad Y
fr_fr: pad gauche Y

source: right pad X
fr_fr: pad droit X

source: right pad Y
fr_fr: pad droit Y

source: L2 value
fr_fr: valeur de L2

source: R2 value
fr_fr: valeur de R2

source: Swap {axis1} and {axis2}
fr_fr: Échanger {axis1} et {axis2}

source: Disable {button}
fr_fr: Désactiver {button}

source: Custom action: {line}
fr_fr: Action personnalisée: {line}

source: empty
fr_fr: vide

source: Gyro aiming when pressing {buttons}
fr_fr: Visée gyroscopique lorsque {buttons} sont enfoncés

source: New features
fr_fr: Nouvelles fonctionnalités

source: Bugs fixes
fr_fr: Correctifs

source: Others
fr_fr: Autres

source: New configuration
fr_fr: Nouvelle configuration

source: Done
fr_fr: Terminé

source: Edit
fr_fr: Édition

source: New release available
fr_fr: Une nouvelle version est disponible

source: Uploading to {name}...
fr_fr: Téléversement vers {name}...

source: CRC check...
fr_fr: Vérification du CRC...

source: The CRC check failed. You will probably want to retry.
fr_fr: Le CRC a échoué. Vous voudrez probablement réessayer.

source: Warning
fr_fr: Avertissement

source: Cannot connect to device: {error}
fr_fr: Impossible de se connecter au périphérique: {error}

source: Upload error
fr_fr: Erreur de téléversement

source: Error uploading to device: {error}
fr_fr: Erreur lors du téléversement vers le périphérique: {error}

source: Restarting proxy...
fr_fr: Redémarrage du mandataire...

source: Drop an image here
fr_fr: Déposez une image ici

source: Cancel
fr_fr: Annuler

source: File
fr_fr: Fichier

source: Help
fr_fr: Aide

source: <i>groups</i> exited with code {code}
fr_fr: <b>avrdude</b> s’est terminé avec le code {code}.

source: Cannot find groups
fr_fr: Impossible de déterminer les groupes

source: Unable to find out which groups you belong to:<p />{error}<p />For this program to work correctly, you must belong to the <i>plugdev</i> group.
fr_fr: Impossible de déterminer à quels groupes vous appartenez:<p />{error}<p />Pour que ce programme fonctionne correctement, vous devez appartenir au groupe <i>plugdev</i>.

source: The following operations must be done before this program can work correctly:
fr_fr: Les opérations suivantes doivent être exécutées pour que ce programme fonctionne correctement:

source: Install udev rules to allow HID communication
fr_fr: Installation des règles udev pour les communications HID

source: Add you to the <i>plugdev</i> group
fr_fr: Vous ajouter au groupe <i>plugdev</i>

source: You may have to logout and login again, or even reboot, and unplug/replug the Arduino for those changes to apply.
fr_fr: Vous aurez peut-être à vous déconnecter, voire redémarrer, et débrancher/rebrancher l'Arduino pour que ces modifications soient effectives.

source: You may be prompted for your password.
fr_fr: Vous aurez peut-être à fournir votre mot de passe.

source: System setup
fr_fr: Configuration du système

source: Unable to find <i>sudo</i> on the path.
fr_fr: Impossible de trouver <i>sudo</i> dans le chemin.

source: Error
fr_fr: Erreur

source: Command failed with exit code {code}.<p />{stderr}
fr_fr: La commande a échoué avec le code de retour {code}.<p />{stderr}

source: Password needed
fr_fr: Mot de passe nécessaire

source: You need to enter your password to setup groups and udev rules.
fr_fr: Vous devez entrer votre mot de passe pour configurer les groupes et les règles udev.

source: Downloading manifest...
fr_fr: Téléversement du manifeste...

source: Cannot download manifest:{error}
fr_fr: Impossible de télécharger le manifeste: {error}

source: Bummer
fr_fr: Merde alors

source: Downloading image...
fr_fr: Téléchargement de l'image...

source: Cannot download image: {error}
fr_fr: Impossible de télécharger l'image: {error}

source: Browse
fr_fr: Parcourir

source: Autodetect
fr_fr: Détecter automatiquement

source: Path to avrdude
fr_fr: Chemin vers avrdude

source: Developper mode
fr_fr: Mode développeur

source: Miscellaneous
fr_fr: Divers

source: Undo
fr_fr: Défaire

source: Undo last action
fr_fr: Défaire la dernière action

source: Redo
fr_fr: Refaire

source: Redo last undone action
fr_fr: Refaire la dernière action défaite

source: Pair a DualShock 4 and a PS4 to this DSRemap-enabled device
fr_fr: Appairer une Dualshock 4 et une PS4 à ce périphérique DSRemap

source: Pair to PS4 and Dualshock
fr_fr: Appariement avec la PS4 et la Dualshock

source: Reboot
fr_fr: Redémarrer

source: Halt
fr_fr: Arrêter

source: Add an action to disable a button
fr_fr: Ajouter une action pour désactiver un bouton

source: Disable button
fr_fr: Désactiver un bouton

source: Add an action to invert an axis
fr_fr: Ajouter une action pour inverser un axe

source: Invert pad axis
fr_fr: Inverser l’axe d’un pad

source: Add an action to swap two axis
fr_fr: Ajouter une action pour échanger deux axes

source: Swap axis
fr_fr: Échanger les axes

source: Add an action to implement gyro aiming
fr_fr: Ajouter une action pour implémenter la visée gyroscopique

source: Gyro aiming
fr_fr: Visée gyroscopique

source: Add a custom action and open the code editor
fr_fr: Ajouter une action personnalisée et ouvrir l’éditeur de code

source: Custom action
fr_fr: Action personnalisée

source: Add a remapping action
fr_fr: Ajouter une action de réécriture

source: Delete the selected action
fr_fr: Supprimer l’action sélectionnée

source: Convert the selected action to a custom one and open the code editor
fr_fr: Convertir l’action sélectionnée en action personnalisée et ouvrir l’éditeur de code

source: No device detected
fr_fr: Aucun périphérique détecté

source: Devices
fr_fr: Périphériques

source: Upload
fr_fr: Téléverser

source: Firmware version mismatch
fr_fr: Différence de version du microcode

source: A {appname}-enabled device was plugged, but the firmware version v{version1} does not match the one supported by this application (v{version2}). Please update the firmware using the Upload menu first, then unplug and replug the device.
fr_fr: Un périphérique compatible {appname} a été branché, mais la version du microcode v{version1} ne correspond pas à celle supportée par cette application (v{version2}). Veuillez mettre à jour le microcode via le menu Téléverser, puis débrancher et rebrancher le périphérique.

source: Send selected configuration(s) to device {name}
fr_fr: Envoyer les configurations sélectionnées au périphérique {name}

source: Export selected configuration
fr_fr: Exporter la configuration sélectionnée

source: Export the selected configuration as a zip file
fr_fr: Exporter la configuration sélectionnée sous forme de fichier zip

source: Cannot export configuration: {error}
fr_fr: Impossible d’exporter la configuration: {error}

source: Export error
fr_fr: Erreur d’exportation

source: Import a previously exported configuration
fr_fr: Importer une configuration précédemment exportée

source: Import configuration
fr_fr: Importer une configuration

source: Cannot import configuration: {error}
fr_fr: Impossible d’importer la configuration: {error}

source: Import error
fr_fr: Erreur d’importation

source: Export bytecode
fr_fr: Exporter le code à octets

source: Export bytecode to file
fr_fr: Exporter le code à octets dans un fichier

source: Cannot export bytecode: {error}
fr_fr: Impossible d’exporter le code à octets: {error}

source: Program the microcontroller with DSRemap firmware (if you use an Arduino)
fr_fr: Programmer le microcontrôleur avec le microcode DSRemap (si vous utilisez un Arduino)

source: Update Arduino firmware
fr_fr: Mise à jour du microcode de l'Arduino

source: Create an image file for the Raspberry Pi Zero W
fr_fr: Création d'un fichier image pour le Raspberry Pi Zero W

source: Setup a new SD card for the RPi0 W
fr_fr: Préparer une nouvelle carte SD pour le RPi0 W

source: About {appname}...
fr_fr: À propos de {appname}...

source: Settings...
fr_fr: Préférences...

source: Open documentation
fr_fr: Ouvrir la documentation

source: Create a new configuration
fr_fr: Créer une nouvelle configuration

source: Delete the selected configuration
fr_fr: Supprimer la configuration sélectionnée

source: Save
fr_fr: Enregistrer

source: Overwrite file?
fr_fr: Écraser le fichier ?

source: This file already exists. Overwrite?
fr_fr: Ce fichier existe déjà. L’écraser ?

source: Open file
fr_fr: Ouvrir un fichier

source: Try to detect avrdude again
fr_fr: Réessayer de détecter avrdude

source: You can install <b>avrdude</b> on mac OS using <a href="https://brew.sh">Homebrew</a>. After installing brew, launch a terminal and type<br /><pre>brew install avrdude</pre>
fr_fr: Vous pouvez installer <b>avrdude</b> sur mac OS via <a href="https://brew.sh">Homebrew</a>. Après avoir installé brew, lancez un terminal et tapez<br /><pre>brew install avrdude</pre>

source: You can install <b>avrdude</b> on Linux using your regular package manager, for instance<br /><pre>apt-get install avrdude</pre>
fr_fr: Vous pouvez installer <b>avrdude</b> sur Linux grâce à votre gestionnaire de paquets habituel, par exemple<br /><pre>apt-get install avrdude</pre>

source: You can install <b>avrdude</b> on Windows using <a href="https://sourceforge.net/projects/winavr/">WinAVR</a>
fr_fr: Vous pouvez installer <b>avrdude</b> sous Windows en installant <a href="https://sourceforge.net/projects/winavr/">WinAVR</a>

source: Install avrdude
fr_fr: Installer avrdude

source: The <b>avrdude</b> program could not be found on the path. Please install it or manually specify its path here.
fr_fr: Le programme <b>avrdude</b> n’a pas été trouvé. Veuillez l’installer ou spécifier son chemin ici.

source: <b>avrdude</b> was found at {path}; you can specify another one here.
fr_fr: <b>avrdude</b> a été trouvé sous {path}; vous pouvez en spécifier un autre ici.

source: Browse for avrdude
fr_fr: Checher avrdude

source: Firmware upload
fr_fr: Mise à jour du microcode

source: Please plug the Leonardo to this computer and press the <b>reset</b> button. Click Continue while holding it.
fr_fr: Veuillez brancher le Leonardo à cet ordinateur et appuyer sur le bouton <b>reset</b>. Cliquez sur Continuer en le maintenant enfoncé.

source: Looking for Leonardo
fr_fr: Recherche du Leonardo

source: Release the <b>reset</b> button now.
fr_fr: Relâchez le bouton <b>reset</b> maintenant.

source: Found Leonardo at {path}.
fr_fr: Leonardo trouvé sur {path}.

source: Error resetting the device: {error}
fr_fr: Erreur lors de la réinitialisation du périphérique: {error}

source: Updating
fr_fr: Mise à jour

source: Update in progress...
fr_fr: Mise à jour en cours...

source: Process failed to start
fr_fr: Le processus n’a pas pu démarrer

source: Process crashed
fr_fr: Le processus s’est vautré

source: Timeout
fr_fr: Dépassement de délai

source: Write error
fr_fr: Erreur d’écriture

source: Read error
fr_fr: Erreur de lecture

source: Unknown error
fr_fr: Erreur inconnue

source: Error launching avrdude: {error}
fr_fr: Erreur au lancement de avrdude: {error}

source: Done.
fr_fr: Terminé.

source: You can now upload configurations to this device (Upload menu) and then plug it between the PS4 and Dualshock.
fr_fr: Vous pouvez maintenant téléverser des configurations vers ce périphérique (menu Téléverser) puis le brancher entre votre PS4 et le Dualshock.

source: <b>avrdude</b> exited with code {code}. Something went wrong.
fr_fr: <b>avrdude</b> s’est terminé avec le code {code}. Quelque chose a foiré.

source: Do that later
fr_fr: Faire ça plus tard

source: Device type
fr_fr: Type de périphérique

source: Choose what kind of device you want to configure
fr_fr: Choisissez quel type de périphérique vous voulez configurer

source: Unknown page {page}
fr_fr: Page inconnue {page}

source: Skipped
fr_fr: Ignoré

source: Skipped initial device configuration. You can configure your devices later from the Devices menu.
fr_fr: La configuration initiale du périphérique est ignorée. Vous pouvez configurer vos périphériques plus tard depuis le menu Périphériques.

source: Please enter the credentials for your Wifi network. The Raspberry Pi will automatically connect to this network. If left empty, you will have to configure it yourself after creating the SD card.
fr_fr: Veuillez entrer les identifiants de votre réseau Wifi. Le Raspberry Pi se connectera automatiquement à ce réseau. Si vous laissez ces champs vides, vous devrez le configurer vous-même après avoir créé la carte SD.

source: Password
fr_fr: Mot de passe

source: Confirm password
fr_fr: Confirmer le mot de passe

source: Wifi configuration
fr_fr: Configuration Wifi

source: Image copy
fr_fr: Copie de l'image

source: Copying image file
fr_fr: Copie du fichier image

source: Error copying file: {error}
fr_fr: Erreur de copie du fichier: {error}

source: <p>The image file has been copied to your Downloads folder.</p> <p>You can now use the <a href="https://www.raspberrypi.org/software/">Raspberry Pi Imager</a> to create the SD card for your Raspberry Pi Zero W, using the Custom image option.</p> <p>Once you are done, insert the SD card in your Pi and power it on. Position it near your PS4 because you will have to connect both during the pairing process.</p> <p>The first boot may take some time; wait until the device appears in the Device menu and then proceed with the pairing option.</p>
fr_fr: <p>Le fichier image a été copié dans votre répertoire Téléchargements.</p> <p>Vous pouvez maintenant utiliser le <a href="https://www.raspberrypi.org/software/">créateur d'images Raspberry Pi</a> pour créer la carte SD pour votre Raspberry Pi Zero W, en utilisant l'option Image personnalisée.</p> <p>Une fois cela fait, insérez la carte SD dans votre Pi et branchez-le à l'alimentation. Mettez-le près de votre PS4 car vous aurez besoin de connecter les deux lors du processus d'appariement.</p> <p>Le premier démarrage peut prendre un certain temps; attendez jusqu'à ce que le périphérique apparaisse dans le menu Périphériques puis lancez l'option d'appariement.</p>

source: Create SD card
fr_fr: Création de la carte SD

source: Device lookup
fr_fr: Recherche du périphérique

source: Looking for a configured RPi Zero W on your network...
fr_fr: Recherche d'un RPi Zero W configuré sur votre réseau...

source: Preparing to pair the PS4
fr_fr: Préparation de l'appairement de la PS4

source: First, power on your PS4 and plug the Raspberry Pi to it. Click Next when done.
fr_fr: Tout d'abord, allumez votre PS4 et branchez-y le Raspberry Pi. Cliquez sur Continuer lorsque c'est fait.

source: Pairing PS4
fr_fr: Appairement de la PS4

source: Getting device information...
fr_fr: Obtention des informations du périphérique...

source: Error connecting to the device: {error}
fr_fr: Erreur de connexion au périphérique: {error}

source: Error getting info from device: {error}
fr_fr: Erreur lors de l'obtention des informations du périphérique: {error}

source: Waiting for the PS4...
fr_fr: En attente de la PS4...

source: Error while pairing the PS4: {code}
fr_fr: Erreur lors de l'appairement de la PS4: {code}

source: Error while pairing the PS4
fr_fr: Une erreur lors de l'appairement de la PS4

source: Waiting for Dualshock
fr_fr: En attente de la Dualshock

source: You can now unplug the Raspberry Pi from the PS4, but leave it powered. Please plug your DualShock controller to this PC.
fr_fr: Vous pouvez maintenant débrancher le Raspberry Pi de la PS4, en le laissant allumé. Veuillez brancher votre contrôleur DualShock à ce PC.

source: Pairing controller
fr_fr: Appairement du contrôleur

source: Pairing the controller, please wait...
fr_fr: Contrôleur en cous d'appairement, veuillez patienter...

source: Obtaining MAC address...
fr_fr: Obtention de l'adresse MAC...

source: Uploading pairing info...
fr_fr: Téléversement des informations d'appairement...

source: Error uploading pairing info: {error}
fr_fr: Erreur lors du téléversement des informations d'appairement: {error}

source: Pairing the controller...
fr_fr: Appairement du contrôleur...

source: Finished
fr_fr: Terminé

source: Done. You can unplug the DualShock and press PS to start using it through the proxy.
fr_fr: C'est fait. Vous pouvez débrancher la DualShock et appuyer sur PS pour commencer à l'utiliser à travers le mandataire.

source: No configuration selected
fr_fr: Aucune configuration sélectionnée

source: {count} configurations selected ({size} bytes). You can only upload multiple configurations to an Arduino (not to a Pi Zero), if the size does not exceed 1024 bytes.
fr_fr: {count} configuration(s) sélectionnée(s) ({size} octets). Vous ne pouvez téléverser plusieurs configurations que vers un Arduino (pas un Pi Zero), à condition que la taille n'excède pas 1024 octets.
